---
kind: method
id: M:Autodesk.Revit.DB.Dimension.HasOneSegment
zh: 尺寸标注、标注
source: html/7fc64c23-c5fc-9180-26bd-f52749178056.htm
---
# Autodesk.Revit.DB.Dimension.HasOneSegment Method

**中文**: 尺寸标注、标注

Determines whether a dimension has one segment.

## Syntax (C#)
```csharp
public bool HasOneSegment()
```